app/controllers/concerns/current_cart.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-11-28 16:15:08.687775"], ["updated_at", "2018-11-28 16:15:08.687775"]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_cart
        @cart = Cart.find_by id: (session[:cart_id]) || Cart.create