app/views/line_items/index.html.erb

<!------ Include the above in your HEAD tag ---------->
<% @cart.line_items.each do |item| %>
---
SELECT "line_items".* FROM "line_items"